from random import random
print(int(random.randrange(1, 11, 1))

# вот тут мне кажется я на костылях прошел...
# В коде подключена функция random(). Она random() возвращает случайное число от 0 до 1 с большим количеством знаков после запятой. Но в реальных задачах бывает нужно получать случайные целые числа в заданном диапазоне.

# Реализуйте код, который печатает на экран случайное число вдиапазоне от 1 до 10. Для этого вам понадобятся операции умножения, сложения, а также преобразование типов. random() возвращает float, а нам нужен int.

# Попробуйте решить это задание в одну строку.

# Подсказка
# random() возвращает число в диапазоне [0, 1). Такая запись обозначает, что 0 включается в диапазон, а 1 – нет.
